app/views/gossips/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
---
            <h5 class="card-title">Title: <%= @gossips.title %></h5>
            <h6 class="card-subtitle mb-2 text-muted">Author: <%= @gossips.user.first_name%></h6>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---
    <article>
        <h4 class="desc-title">Comment of <%= comm.user.first_name %> </h4>