app/controllers/comments_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", " fzgfzgfzfgzr"], ["user_id", 16], ["gossip_id", 42], ["created_at", "2022-11-03 16:39:01.730729"], ["updated_at", "2022-11-03 16:39:01.730729"]]
---
      def create
        @comment = Comment.new('gossip_id' => params[:gossip_id], 'content' => params[:content], user: User.find_by(id: session[:user_id]))
        if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 56], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "test 888"], ["updated_at", "2022-11-04 11:37:13.352019"], ["id", 56]]
---
      def update
        @comment = Comment.find(params[:id])
        @comment_params = params.permit(:content)
        if @comment.update(@comment_params)

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 56], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
---
      def user_is_op
          puts "****"
          puts session[:user_id]
          puts "****"
          unless session[:user_id] == Comment.find(params[:id]).user.id