app/controllers/gossips_controller.rb

    def show
        @gossips = Gossip.find(params[:id])
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        user = User.find_by(id: session[:user_id])
        @gossips = Gossip.new(title: params[:title], content: params[:content], user_id: user.id)
        if @gossips.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["content", "test"], ["user_id", 28], ["created_at", "2022-11-04 09:59:33.047436"], ["updated_at", "2022-11-04 09:59:33.047436"]]

    def edit
        @gossips = Gossip.find(params[:id])
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]

    def update
        @gossips = Gossip.find(params[:id])
        if @gossips.update(title: params[:title], content: params[:content])
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["content", "aaaa"], ["updated_at", "2022-11-04 11:22:43.423933"], ["id", 28]]

    def destroy
        @gossips = Gossip.find(params[:id])
        @gossips.destroy
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 26]]

    def user_is_op
        puts "****"
        puts session[:user_id]
        puts "****"
        unless session[:user_id] == Gossip.find(params[:id]).user.id
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]