app/controllers/sessions_controller.rb

    def create
        # cherche s'il existe un utilisateur en base avec l’e-mail
        user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jack-DG@get.com"], ["LIMIT", 1]]

    def destroy
      puts "**************************"
      user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 88], ["LIMIT", 1]]