app/controllers/users_controller.rb

  def create
    @user = User.new(post_params)
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "description", "email", "age", "city_id", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def cities_list
    cities =[]
    City.all.each {|city| cities << city}
---
SELECT "cities".* FROM "cities"